btn = document.querySelector('button.menu-button');
btn_close = document.querySelector('button.menu-close');
items = document.querySelector('.menu-items');

btn.addEventListener("click",function(){
    items.classList.toggle("hidden");
    this.classList.toggle("hidden");
    btn_close.classList.toggle("hidden");
});
btn_close.addEventListener("click",function(){
    items.classList.toggle("hidden");
    this.classList.toggle("hidden");
    btn.classList.toggle("hidden");
});

const servicesListArabic = [
    'طباعة رسالة عرض العمل',
    'تجديد تصريح عمل الكتروني أو طباعة عقد العمل',
    'استلام معاملة تصريح عمل الكتروني جديد و تصريح عمل الكترون',
    'اصدار بطاقة التوقيع الإلكتروني الجديدة المالك',
    'طباعة تصريح عمل الكتروني جديد',
    'غرامة تصريح عمل الكتروني و اشعار الموافقة المبدئية لتصريح العمل',
    'استبدال بطاقة التوقيع الإلكتروني القديمة ببطاقة التوقيع الإلكتروني الجديدة',
    'حضور الدورة التوجيهية للعمال',
    'طباعة جميع البطاقات الذكية',
    'تفعيل بطاقة التوقيع الإلكتروني الجديدة للمالك – المندوب',
    'اصدار البطاقة الذكية للمندوب',
    'معاملة تجديد بطاقة العمل',
    'توزيع النشرات التوعوية للعمال و أصحاب العمل',
    'اصدار شهادة العمل للعمال',
    'تقديم خدمات تسليم تصاريح العمل و عقود العمال',
    'طباعة طلب اشعار الموافقة المبدئية لتصريح العمل المؤقت',
    'استلام اشعار الموافقة المبدئية لتصريح عمل مؤقت / اختبار',
    'استلام معاملة الى سحب بلاغ هروب',
    'طلب الغاء تصريح عمل الكتروني لعامل لديه قضية عمالية',
]

const pricedServices = [
    {
        name: 'طباعة رسالة عرض العمل',
        price: 103,
        requirements: [
            ' نسخة من جواز السفر',
            ' بطاقة التوقيع الالكتروني',
            'اسم مقدم الطلب بالعربية و الإنكليزية'
        ]
    },
    {
        name: 'تجديد تصريح العمل الالكتروني (طباعة عقد العمل)',
        price: 83,
        requirements: [
            'اذن الدخول القديم',
            'صورة شخصية',
            'بطاقة التوقيع الإلكتروني'
        ]
    },
    {
        name: 'تصريح عمل جديد',
        price: 83,
        requirements: [
            'نسخة عن جواز السفر',
            'رقم بطاقة العمل',
            'اذن دخول للعمل مع تاريخ الدخول او تعديل وضع مع تاريخ الموافقة',
            'صورة شخصية',
            'بطاقة التوقيع الإلكتروني'
        ]
    },
    {
        name: 'تصريح عمل الكتروني و تصريح عمل الكتروني مهمة',
        price: 136,
        requirements: [
            'حضور المادة التوعوية',
            'عقد العمل النهائي الموقع و بصمة العامل عليه',
            'اذن دخول للعمل'
        ]
    },
    {
        name: 'استبدال بطاقة التوقيع الالكتروني القديمة بالجديدة',
        price: 123,
        requirements: [
            'الهوية الإماراتية',
            'بطاقة التوقيع الإلكتروني القديمة',
        ]
    },
    //aohouihauh
    {
        name: 'تصريح عمل إلكتروني / موافقة مسبقة لغرامات تصريح العمل',
        price: 'الغرامة + 43 درهم',
        requirements: [

        ]
    },
    {
        name: 'بطاقة توقيع إلكترونية جديدة للمالكين',
        price: 123,
        requirements: [
            'الهوية الإماراتية للمالك',
            'رقم الشخص'
        ]
    },
    {
        name: 'التوقيع الإلكتروني الجديدة للمالك / المندوب تفعيل بطاقة',
        price: 123,
        requirements: [
            'الهوية الإماراتية للمالك/المندوب',
            'البطاقة الذكية المطبوعة',
            'وجود المالك لأخد البصمة',
            'وجود المندوب لأخذ البصمة'
        ]
    },
    {
        name: 'تقديم طلب تجديد بطاقة عمل',
        price: `(تختلف الأسعار تبعا لتصنيف الشركة أو درجتها)
        عامل ماهر - عامل ذو مستوى مهاري منخفض A- 1063 - 753 AED B- 1413 - 1253 AED C- 1813 - 1753 AED D- 2363 - 2253 AED
        `,
        requirements: [
            'عقد العمل النهائي موقعاً أوعليه البصمة'
        ]
    },
    {
        name: 'بطاقة توقيع إلكتروني جديدة للمندوبين',
        price: 123,
        requirements: [
            'بطاقة التوقيع الإلكتروني للمالك',
            'الهوية الإماراتية للمالك',
            'برائة ذمة من من الشرطة لمقدم الطلب',
            'نسخة عن جواز سفر مقدم الطلب',
            'نسخة اذن دخول للعمل لإثبات الصلة بالشركة',
            'صورة شخصية',
            'نسخة عن الرخصة التجارية',
            'رقم تسجيل الشركة في مكتب العمل',
        ]
    },
    {
        name: 'طباعة بطاقة التوقيع الإلكتروني',
        price: 93,
        requirements: [
            'رقم المعاملة',
            'رقم المعاملة',
        ]
    },
    {
        name: 'طباعة طلب اشعار الموافقة المبدئية لتصريح العمل المؤقت',
        price: 83,
        requirements: [
            'بطاقة التوقيع الإلكتروني',
            'نسخة من جواز السفر',
            'اذن الدخول',
            'صورة شخصية',
            'رقم المعاملة'
        ]
    },
    {
        name: 'استلام اشعار الموافقة المبدئية لتصريح عمل مؤقت / اختبار',
        price: 83,
        requirements: [
            'بطاقة التوقيع الإلكتروني',
            'نسخة من جواز السفر',
            'اذن الدخول',
            'صورة شخصية',
            'رقم المعاملة'
        ]
    },
    {
        name: 'استلام معاملة الى سحب بلاغ هروب',
        price: 83,
        requirements: [
            'رقم بطاقة العمل',
            'نسخة عن الإقامة',
        ]
    },
    {
        name: 'طلب الغاء تصريح عمل إلكتروني لعامل لديه قضية عمالية',
        price: 83,
        requirements: [
            'رقم المنشأة',
            'رقم بطاقة العمل',
            'نسخة عن جواز السفر',
            'اذن الدخول',
        ]
    },
    {
        name: 'إستقبال الشكاوي العمالية من الطرفين',
        price: 83,
        requirements: [
            'Emirates ID',
            'نسخة عن جواز السفر',
            'نسخة من الإقامة' ,
            'صورة من عقد العمل'
        ]
    },

]